src/InformationRegisters/итГруппыКСОНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>итГруппыКСОНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Удалена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаКСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.итГруппыНоменклатурыКСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/итГруппыКСОНоменклатуры/Ext/ManagerModule.bsl
Процедура ДобавитьЗаписьГруппы(Номенклатура, Группа) Экспорт
	
	МЗ = РегистрыСведений.итГруппыКСОНоменклатуры.СоздатьМенеджерЗаписи();
	МЗ.Период = ТекущаяДата();
	МЗ.Номенклатура = Номенклатура;
	МЗ.ГруппаКСО = Группа;
	МЗ.Записать();		
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	итГруппыКСОНоменклатурыСрезПоследних.ГруппаКСО КАК ГруппаКСО
	//|ИЗ
	//|	РегистрСведений.итГруппыКСОНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК итГруппыКСОНоменклатурыСрезПоследних
	//|ГДЕ
	//|	итГруппыКСОНоменклатурыСрезПоследних.Удалена = ЛОЖЬ";
	//
	//Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если РезультатЗапроса.Пустой() Тогда
	//	МЗ = РегистрыСведений.итГруппыКСОНоменклатуры.СоздатьМенеджерЗаписи();
	//	МЗ.Период = ТекущаяДата();
	//	МЗ.Номенклатура = Номенклатура;
	//	МЗ.ГруппаКСО = Группа;
	//	МЗ.Записать();		
	//Иначе
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	ВыборкаДетальныеЗаписи.Следующий();
	//	Если ВыборкаДетальныеЗаписи.ГруппаКСО <> Группа Тогда
	//		МЗ = РегистрыСведений.итГруппыКСОНоменклатуры.СоздатьМенеджерЗаписи();
	//		МЗ.Период = ТекущаяДата();
	//		МЗ.Номенклатура = Номенклатура;
	//		МЗ.ГруппаКСО = Группа;
	//		МЗ.Записать();
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры
